In [12]:
import pandas as pd
import numpy as np
import gdown
import sqlite3 as sql3

In [5]:
url='https://docs.google.com/spreadsheets/d/12vhXA__uaWSCvua2ROC2MompFS4LkV7D/edit?usp=drive_link&ouid=116045163522511725897&rtpof=true&sd=true'
url='https://drive.google.com/uc?id=' + url.split('/')[-2]
gdown.download(url, 'commercial_data_generated_xls.xlsx', quiet=False)
connection = sql3.connect('db')

Downloading...
From: https://drive.google.com/uc?id=12vhXA__uaWSCvua2ROC2MompFS4LkV7D
To: c:\Users\mail\OneDrive\Documents\my_python\1_sql\commercial_data_generated_xls.xlsx
100%|██████████| 662k/662k [00:00<00:00, 4.97MB/s]

In [29]:
df = pd.read_excel('commercial_data_generated_xls.xlsx')
df['flag'] = np.random.binomial(1, 0.3, len(df))
len(df)

17277

In [30]:
df.to_sql('sales', connection, index = False, if_exists='replace' )

17277

In [31]:
query = """
        SELECT      *
        FROM        sales
        LIMIT 5
        """
pd.read_sql_query(query, connection)

,datetime,order_id,customer_id,item,price,quantity,discount,bundle_discount,flag
0,2024-11-03 12:19:45,2782292,0,item_36,716.0,2,0.0,0.0,0
1,2024-11-03 12:19:45,2782292,0,item_98,240.2,7,0.0,0.0,0
2,2024-11-03 12:19:45,2782292,0,item_96,260.3,8,0.0,0.0,1
3,2024-11-03 12:19:45,2782292,0,item_11,441.2,5,0.0,0.0,0
4,2024-11-03 12:19:45,2782292,0,item_13,297.3,1,0.0,0.0,0

Задача: расчитать медианные значения суммарных месячных трат постоянных клиентов

In [55]:
query = """
        SELECT      strftime('%m', datetime) as month, customer_id, sum(price*quantity) as sum
        FROM        sales
        WHERE       customer_id != 0
        GROUP BY    month, order_id

        """
pd.read_sql_query(query, connection)

     month  customer_id      sum
0       05        93834   5578.8
1       05        11859   3483.7
2       05        39398   4265.6
3       05        88656  15961.2
4       05        86138    962.4
...    ...          ...      ...
2210    12        19353   5887.7
2211    12        87420   5675.5
2212    12        91770   3995.2
2213    12        22094  11659.6
2214    12        64533   1826.3

[2215 rows x 3 columns]

In [1]:
import numpy as np

In [39]:
np.random.randint(1,101, 1)

array([12], dtype=int32)